---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallStructuralSignificant
source: html/f7060ec3-e287-4826-7de8-bb104e181fa5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallStructuralSignificant Property

"Structural"

## Syntax (C#)
```csharp
public static ForgeTypeId WallStructuralSignificant { get; }
```